work/log.ltccip8.2020-06-14_0656/sysbench-mariadb-oltp-ro-small/iter-0/sysbench/logs/sysbench-raw-5-1
sysbench --mysql-user=root --mysql-password=mmtests-default --mysql-db=sbtest --mysql-socket=/tmp/mysql.sock --mysql-table-engine=innodb --test=oltp --oltp-read-only --oltp-test-mode=complex --oltp-table-size=891000 --num-threads=5 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 5

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Maximum number of requests for OLTP test is limited to 10000
Threads started!
Done.

OLTP test statistics:
    queries performed:
        read:                            140042
        write:                           0
        other:                           20006
        total:                           160048
    transactions:                        10003  (2918.41 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 140042 (40857.79 per sec.)
    other operations:                    20006  (5836.83 per sec.)

Test execution summary:
    total time:                          3.4275s
    total number of events:              10003
    total time taken by event execution: 17.0726
    per-request statistics:
         min:                                  1.42ms
         avg:                                  1.71ms
         max:                                  3.43ms
         approx.  95 percentile:               2.07ms

Threads fairness:
    events (avg/stddev):           2000.6000/131.82
    execution time (avg/stddev):   3.4145/0.00