work/log.ltccip8.2020-06-14_0656/sysbench-mariadb-oltp-ro-small/iter-0/sysbench/logs/sysbench-raw-79-2
sysbench --mysql-user=root --mysql-password=mmtests-default --mysql-db=sbtest --mysql-socket=/tmp/mysql.sock --mysql-table-engine=innodb --test=oltp --oltp-read-only --oltp-test-mode=complex --oltp-table-size=891000 --num-threads=79 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 79

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Maximum number of requests for OLTP test is limited to 10000
Threads started!
Done.

OLTP test statistics:
    queries performed:
        read:                            140168
        write:                           0
        other:                           20024
        total:                           160192
    transactions:                        10012  (18036.61 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 140168 (252512.48 per sec.)
    other operations:                    20024  (36073.21 per sec.)

Test execution summary:
    total time:                          0.5551s
    total number of events:              10012
    total time taken by event execution: 43.1880
    per-request statistics:
         min:                                  1.76ms
         avg:                                  4.31ms
         max:                                 12.33ms
         approx.  95 percentile:               5.50ms

Threads fairness:
    events (avg/stddev):           126.7342/27.76
    execution time (avg/stddev):   0.5467/0.00